Documents/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Договоры</Name>
			<BasedOn>
				<xr:Item>Document.Заказы</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеСудна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельЯхты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МоделиЯхт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покраска</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаСудна</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПредоплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПредоплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПлатежей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапускаВПроизводство</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СпецификацияСудна</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЯхты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЯхт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтандартныйЦвет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеМачты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокАксессуаров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аксессуар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Аксессуары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДополнительныйЦвет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеДоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактыПолучателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяДоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикПлатежей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокЗадолженности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПорядокРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Договоры/Ext/ManagerModule.bsl
Процедура ПечатьДоговора(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьДоговора)
	Макет = Документы.Договоры.ПолучитьМакет("ПечатьДоговора");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договоры.Дата,
	|	Договоры.Доставка,
	|	Договоры.Заказ,
	|	Договоры.Контрагент,
	|	Договоры.МодельЯхты,
	|	Договоры.НаименованиеСудна,
	|	Договоры.Номер,
	|	Договоры.Покраска,
	|	Договоры.ПроцентПредоплаты,
	|	Договоры.Сотрудник,
	|	Договоры.СуммаЗаказа,
	|	Договоры.СуммаПредоплаты,
	|	Договоры.ЦенаСудна,
	|	Договоры.СписокАксессуаров.(
	|		НомерСтроки,
	|		Аксессуар,
	|		ЦенаСНДС,
	|		Количество,
	|		СуммаСНДС
	|	),
	|	Договоры.ДополнительныеРаботы.(
	|		НомерСтроки,
	|		ДополнительныйЦвет,
	|		ЦенаСНДС
	|	),
	|	Договоры.ДанныеДоставки.(
	|		НомерСтроки,
	|		Получатель,
	|		АдресДоставки,
	|		КонтактыПолучателя,
	|		ДатаДоставки,
	|		ВремяДоставки
	|	)
	|ИЗ
	|	Документ.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокАксессуаровШапка = Макет.ПолучитьОбласть("СписокАксессуаровШапка");
	ОбластьСписокАксессуаров = Макет.ПолучитьОбласть("СписокАксессуаров");
	ОбластьДополнительныеРаботыШапка = Макет.ПолучитьОбласть("ДополнительныеРаботыШапка");
	ОбластьДополнительныеРаботы = Макет.ПолучитьОбласть("ДополнительныеРаботы");
	ОбластьДанныеДоставкиШапка = Макет.ПолучитьОбласть("ДанныеДоставкиШапка");
	ОбластьДанныеДоставки = Макет.ПолучитьОбласть("ДанныеДоставки");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		//Из выборки подтянуть значения по совпадающим реквизитам
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		//Из макета ТабДока взять Дату старого формата и переделать на новый вид представления
		ОбластьЗаголовок.Параметры.Дата = Формат(ОбластьЗаголовок.Параметры.Дата,"ДЛФ=DD");
		//Добавить макет в Табличный документ

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокАксессуаровШапка);
		ВыборкаСписокАксессуаров = Выборка.СписокАксессуаров.Выбрать();
		Пока ВыборкаСписокАксессуаров.Следующий() Цикл
			ОбластьСписокАксессуаров.Параметры.Заполнить(ВыборкаСписокАксессуаров);
			ТабДок.Вывести(ОбластьСписокАксессуаров, ВыборкаСписокАксессуаров.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьДополнительныеРаботыШапка);
		ВыборкаДополнительныеРаботы = Выборка.ДополнительныеРаботы.Выбрать();
		Пока ВыборкаДополнительныеРаботы.Следующий() Цикл
			ОбластьДополнительныеРаботы.Параметры.Заполнить(ВыборкаДополнительныеРаботы);
			ТабДок.Вывести(ОбластьДополнительныеРаботы, ВыборкаДополнительныеРаботы.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьДанныеДоставкиШапка);
		ВыборкаДанныеДоставки = Выборка.ДанныеДоставки.Выбрать();
		Пока ВыборкаДанныеДоставки.Следующий() Цикл
			ОбластьДанныеДоставки.Параметры.Заполнить(ВыборкаДанныеДоставки);
			ТабДок.Вывести(ОбластьДанныеДоставки, ВыборкаДанныеДоставки.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура ПечатьСчета(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьСчета)
	Макет = Документы.Договоры.ПолучитьМакет("ПечатьСчета");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договоры.Дата,
	|	Договоры.Заказ,
	|	Договоры.Контрагент,
	|	Договоры.НаименованиеСудна,
	|	Договоры.Номер,
	|	Договоры.ПроцентПредоплаты,
	|	Договоры.Сотрудник,
	|	Договоры.СуммаЗаказа,
	|	Договоры.СуммаПредоплаты,
	|	Договоры.ЦенаСудна,
	|	Договоры.СписокАксессуаров.(
	|		НомерСтроки,
	|		Аксессуар,
	|		СуммаСНДС
	|	),
	|	Договоры.ДополнительныеРаботы.(
	|		НомерСтроки,
	|		ДополнительныйЦвет,
	|		ЦенаСНДС
	|	)
	|ИЗ
	|	Документ.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокАксессуаровШапка = Макет.ПолучитьОбласть("СписокАксессуаровШапка");
	ОбластьСписокАксессуаров = Макет.ПолучитьОбласть("СписокАксессуаров");
	ОбластьДополнительныеРаботыШапка = Макет.ПолучитьОбласть("ДополнительныеРаботыШапка");
	ОбластьДополнительныеРаботы = Макет.ПолучитьОбласть("ДополнительныеРаботы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		//Из выборки подтянуть значения по совпадающим реквизитам
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		//Из макета ТабДока взять Дату старого формата и переделать на новый вид представления
		ОбластьЗаголовок.Параметры.Дата = Формат(ОбластьЗаголовок.Параметры.Дата,"ДЛФ=DD");
		//Добавить макет в Табличный документ

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокАксессуаровШапка);
		ВыборкаСписокАксессуаров = Выборка.СписокАксессуаров.Выбрать();
		Пока ВыборкаСписокАксессуаров.Следующий() Цикл
			ОбластьСписокАксессуаров.Параметры.Заполнить(ВыборкаСписокАксессуаров);
			ТабДок.Вывести(ОбластьСписокАксессуаров, ВыборкаСписокАксессуаров.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьДополнительныеРаботыШапка);
		ВыборкаДополнительныеРаботы = Выборка.ДополнительныеРаботы.Выбрать();
		Пока ВыборкаДополнительныеРаботы.Следующий() Цикл
			ОбластьДополнительныеРаботы.Параметры.Заполнить(ВыборкаДополнительныеРаботы);
			ТабДок.Вывести(ОбластьДополнительныеРаботы, ВыборкаДополнительныеРаботы.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура ПечатьГрафикаПлатежей(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьГрафикаПлатежей)
	Макет = Документы.Договоры.ПолучитьМакет("ПечатьГрафикаПлатежей");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договоры.Дата,
	|	Договоры.ДатаПервогоПлатежа,
	|	Договоры.Заказ,
	|	Договоры.КоличествоПлатежей,
	|	Договоры.Контрагент,
	|	Договоры.НаименованиеСудна,
	|	Договоры.Номер,
	|	Договоры.Сотрудник,
	|	Договоры.СуммаЗаказа,
	|	Договоры.СуммаПредоплаты,
	|	Договоры.ГрафикПлатежей.(
	|		НомерСтроки,
	|		ДатаПлатежа,
	|		СуммаПлатежа,
	|		ОстатокЗадолженности
	|	)
	|ИЗ
	|	Документ.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьГрафикПлатежейШапка = Макет.ПолучитьОбласть("ГрафикПлатежейШапка");
	ОбластьГрафикПлатежей = Макет.ПолучитьОбласть("ГрафикПлатежей");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		//Из выборки подтянуть значения по совпадающим реквизитам
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		//Из макета ТабДока взять Дату старого формата и переделать на новый вид представления
		ОбластьЗаголовок.Параметры.Дата = Формат(ОбластьЗаголовок.Параметры.Дата,"ДЛФ=DD");
		//Добавить макет в Табличный документ

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьГрафикПлатежейШапка);
		ВыборкаГрафикПлатежей = Выборка.ГрафикПлатежей.Выбрать();
		Пока ВыборкаГрафикПлатежей.Следующий() Цикл
			ОбластьГрафикПлатежей.Параметры.Заполнить(ВыборкаГрафикПлатежей);
			ТабДок.Вывести(ОбластьГрафикПлатежей, ВыборкаГрафикПлатежей.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура ПечатьСпецификации(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьСпецификации)
	Макет = Документы.Договоры.ПолучитьМакет("ПечатьСпецификации");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договоры.Дата,
	|	Договоры.Заказ,
	|	Договоры.Контрагент,
	|	Договоры.МодельЯхты,
	|	Договоры.НаименованиеСудна,
	|	Договоры.Номер,
	|	Договоры.Сотрудник,
	|	Договоры.СпецификацияСудна.(
	|		НомерСтроки,
	|		ТипЯхты,
	|		Материал,
	|		СтандартныйЦвет,
	|		НаличиеМачты,
	|		КоличествоМест
	|	),
	|	Договоры.СписокАксессуаров.(
	|		НомерСтроки,
	|		Аксессуар,
	|		Количество
	|	),
	|	Договоры.ДополнительныеРаботы.(
	|		НомерСтроки,
	|		ДополнительныйЦвет
	|	)
	|ИЗ
	|	Документ.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСпецификацияСуднаШапка = Макет.ПолучитьОбласть("СпецификацияСуднаШапка");
	ОбластьСпецификацияСудна = Макет.ПолучитьОбласть("СпецификацияСудна");
	ОбластьСписокАксессуаровШапка = Макет.ПолучитьОбласть("СписокАксессуаровШапка");
	ОбластьСписокАксессуаров = Макет.ПолучитьОбласть("СписокАксессуаров");
	ОбластьДополнительныеРаботыШапка = Макет.ПолучитьОбласть("ДополнительныеРаботыШапка");
	ОбластьДополнительныеРаботы = Макет.ПолучитьОбласть("ДополнительныеРаботы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		//Из выборки подтянуть значения по совпадающим реквизитам
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		//Из макета ТабДока взять Дату старого формата и переделать на новый вид представления
		ОбластьЗаголовок.Параметры.Дата = Формат(ОбластьЗаголовок.Параметры.Дата,"ДЛФ=DD");
		//Добавить макет в Табличный документ

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСпецификацияСуднаШапка);
		ВыборкаСпецификацияСудна = Выборка.СпецификацияСудна.Выбрать();
		Пока ВыборкаСпецификацияСудна.Следующий() Цикл
			ОбластьСпецификацияСудна.Параметры.Заполнить(ВыборкаСпецификацияСудна);
			ТабДок.Вывести(ОбластьСпецификацияСудна, ВыборкаСпецификацияСудна.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьСписокАксессуаровШапка);
		ВыборкаСписокАксессуаров = Выборка.СписокАксессуаров.Выбрать();
		Пока ВыборкаСписокАксессуаров.Следующий() Цикл
			ОбластьСписокАксессуаров.Параметры.Заполнить(ВыборкаСписокАксессуаров);
			ТабДок.Вывести(ОбластьСписокАксессуаров, ВыборкаСписокАксессуаров.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьДополнительныеРаботыШапка);
		ВыборкаДополнительныеРаботы = Выборка.ДополнительныеРаботы.Выбрать();
		Пока ВыборкаДополнительныеРаботы.Следующий() Цикл
			ОбластьДополнительныеРаботы.Параметры.Заполнить(ВыборкаДополнительныеРаботы);
			ТабДок.Вывести(ОбластьДополнительныеРаботы, ВыборкаДополнительныеРаботы.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура ПечатьДополнительногоОборудования(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьДополнительногоОборудования)
	Макет = Документы.Договоры.ПолучитьМакет("ПечатьДополнительногоОборудования");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договоры.Дата,
	|	Договоры.ДатаЗапускаВПроизводство,
	|	Договоры.Заказ,
	|	Договоры.Контрагент,
	|	Договоры.НаименованиеСудна,
	|	Договоры.Номер,
	|	Договоры.Сотрудник,
	|	Договоры.СписокАксессуаров.(
	|		НомерСтроки,
	|		Аксессуар,
	|		ЦенаСНДС,
	|		Количество,
	|		СуммаСНДС
	|	),
	|	Договоры.ПорядокРабот.(
	|		НомерСтроки,
	|		ВидРаботы,
	|		КоличествоДней,
	|		ДатаНачалаРаботы,
	|		ДатаОкончанияРаботы
	|	)
	|ИЗ
	|	Документ.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокАксессуаровШапка = Макет.ПолучитьОбласть("СписокАксессуаровШапка");
	ОбластьСписокАксессуаров = Макет.ПолучитьОбласть("СписокАксессуаров");
	ОбластьПорядокРаботШапка = Макет.ПолучитьОбласть("ПорядокРаботШапка");
	ОбластьПорядокРабот = Макет.ПолучитьОбласть("ПорядокРабот");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		//Из выборки подтянуть значения по совпадающим реквизитам
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		//Из макета ТабДока взять Дату старого формата и переделать на новый вид представления
		ОбластьЗаголовок.Параметры.Дата = Формат(ОбластьЗаголовок.Параметры.Дата,"ДЛФ=DD");
		//Добавить макет в Табличный документ

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокАксессуаровШапка);
		ВыборкаСписокАксессуаров = Выборка.СписокАксессуаров.Выбрать();
		Пока ВыборкаСписокАксессуаров.Следующий() Цикл
			ОбластьСписокАксессуаров.Параметры.Заполнить(ВыборкаСписокАксессуаров);
			ТабДок.Вывести(ОбластьСписокАксессуаров, ВыборкаСписокАксессуаров.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьПорядокРаботШапка);
		ВыборкаПорядокРабот = Выборка.ПорядокРабот.Выбрать();
		Пока ВыборкаПорядокРабот.Следующий() Цикл
			ОбластьПорядокРабот.Параметры.Заполнить(ВыборкаПорядокРабот);
			ТабДок.Вывести(ОбластьПорядокРабот, ВыборкаПорядокРабот.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
